//3.Есть N чиновников, каждый из которых выдает справку определенного вида. Кроме того, у каждого чиновника есть набор справок, которые нужно получить до того,
//как обратиться к нему за справкой. Запрограммировать алгоритм, по которому можно получить все справки.
//Пример:
//N = 4.
//Зависимость между чиновниками – {1,[2]},{ 2,[3,4]} (т.е первый чиновник чтобы дать справку требует справку от второго, а второй от третьего и четвертого).
//Допустимые ответы:
//{ 3, 4, 2, 1}
//{ 4, 3, 2, 1}


using BeFit3;

var clerks = new Clerks();

clerks.AddClerk(1, new List<int> { 2 });
clerks.AddClerk(2, new List<int> { 3, 4 });

var requiredCertificates = clerks.GetClerkOrder();

Console.WriteLine(string.Join(", ", requiredCertificates)); 
